In [1]:
# Import libraries
%matplotlib inline
import math
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# Reading ratings file
ratings_df = pd.read_csv('./resources/ratings.csv', sep='\t', encoding='latin-1', 
                      usecols=['user_id', 'movie_id', 'user_emb_id', 'movie_emb_id', 'rating'])

# Reading ratings file
users_df = pd.read_csv('./resources/users.csv', sep='\t', encoding='latin-1', 
                    usecols=['user_id', 'gender', 'zipcode', 'age_desc', 'occ_desc'])

# Reading ratings file
movies_df = pd.read_csv('./resources/movies.csv', sep='\t', encoding='latin-1', 
                     usecols=['movie_id', 'title', 'genres'])

In [3]:
ratings_df.head()

   user_id  movie_id  rating  user_emb_id  movie_emb_id
0        1      1193       5            0          1192
1        1       661       3            0           660
2        1       914       3            0           913
3        1      3408       4            0          3407
4        1      2355       5            0          2354

In [4]:
users_df.head()

   user_id gender zipcode  age_desc              occ_desc
0        1      F   48067  Under 18          K-12 student
1        2      M   70072       56+         self-employed
2        3      M   55117     25-34             scientist
3        4      M   02460     45-49  executive/managerial
4        5      M   55455     25-34                writer

In [5]:
movies_df.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [6]:
# Row count
print(f'Ratings:',len(ratings_df))
print(f'Users:',len(users_df))
print(f'Movies:',len(movies_df))

Ratings: 1000209
Users: 6040
Movies: 3883

In [7]:
# Merge ratings_df, users_df, and movies_df
main_df = ratings_df.merge(users_df, left_on='user_id', right_on='user_id')
main_df = main_df.merge(movies_df, left_on='movie_id', right_on='movie_id')

In [8]:
# Added a boolean field to show whether the user liked the movie or not
main_df['liked_movie'] = np.where(main_df['rating'] > 3, True, False)

In [9]:
# Eliminating delimiter from zipcode field and replacing with new
split_zip = main_df['zipcode'].str.split('-', expand=True)
main_df['zipcode'] = split_zip[0]

In [10]:
# Genre split
# split_genre = main_df['genres'].str.split('|', expand=True)
# split_genre

In [11]:
# Changing zipcode datatype to int
main_df['zipcode'] = pd.to_numeric(main_df['zipcode'])

In [12]:
print(f'Unique Titles:',main_df.title.unique())
print('------------------------')
print(f'Titles count:', len(main_df.title.unique()))

Unique Titles: ["One Flew Over the Cuckoo's Nest (1975)"
 'James and the Giant Peach (1996)' 'My Fair Lady (1964)' ...
 'White Boys (1999)' 'One Little Indian (1973)'
 'Five Wives, Three Secretaries and Me (1998)']
------------------------
Titles count: 3706

In [13]:
# Zip codes data
zip_code_df = pd.read_csv('./resources/US_zip_codes_CSV/us_zipcodes_by_city.csv')

In [14]:
# Simplified
zip_df = zip_code_df[['state_abbr','city','zip_code']]

In [15]:
# Merge main_df with zip_df
main_df = main_df.merge(zip_df, left_on='zipcode', right_on='zip_code')

In [16]:
# Drop columns
# Final Dataframe
main_df.drop(['city','zip_code','user_emb_id','movie_emb_id','zipcode'], axis=1, inplace=True)
main_df.head()

,user_id,movie_id,rating,gender,age_desc,occ_desc,title,genres,liked_movie,state_abbr
0,1,1193,5,F,Under 18,K-12 student,One Flew Over the Cuckoo's Nest (1975),Drama,True,MI
1,2098,1193,4,M,35-44,writer,One Flew Over the Cuckoo's Nest (1975),Drama,True,MI
2,1,661,3,F,Under 18,K-12 student,James and the Giant Peach (1996),Animation|Children's|Musical,False,MI
3,2098,661,3,M,35-44,writer,James and the Giant Peach (1996),Animation|Children's|Musical,False,MI
4,1,914,3,F,Under 18,K-12 student,My Fair Lady (1964),Musical|Romance,False,MI

In [17]:
# Export to csv
# main_df.to_csv('./resources/main.csv')

In [18]:
# Training Data
main_data = main_df[['user_id','movie_id','rating']]
# main_data.to_csv('./resources/main_data.csv')
main_data.head()

   user_id  movie_id  rating
0        1      1193       5
1     2098      1193       4
2        1       661       3
3     2098       661       3
4        1       914       3